openfoam9/tutorials/multiphase/cavitatingFoam/LES/throttle3D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 300e5;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 300e5;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100e5;
    }

    walls
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
